tablero/components/PGController.php

    public function __construct($id, $module, $config = [])
    {

        $this->session = new SessionSGO();
        $session = $this->session;
        $srv = $_SERVER["SERVER_NAME"];
        $this->GlobalPath = "http://" . ($srv == "localhost" ? $srv . preg_replace('/^\/([\w\d]+)(\/[\w\W]*)/', "/$1", $_SERVER["REQUEST_URI"]) : $srv);

        // Validación página en Mantenimiento
        $mantenimiento = Desarrollo::find()->one();
---
SELECT * FROM `desarrollo`