tablero/controllers/TableroController.php

    public function actionObras()
    {
        $rangoAnios = array_map(function($elem){
            return date("Y") + $elem;
        }, [
            "desde" => -10,
            "hasta" => 3
        ]);
        for ($anio = $rangoAnios["hasta"]; $anio >= $rangoAnios["desde"]; $anio-- )
            $aniosPosibles[$anio] = $anio;


        $request = Yii::$app->request;
        $requestQueryString = $_SERVER['QUERY_STRING'];

        $mes = $request->get('mes');
        $anio = $request->get('anio');
        $estado = $request->get('estado');
        $idOrganismo = $request->get('idOrganismo') ? $request->get('idOrganismo') : $this->session->get('usr_sgo_idOrganismo');
        $desde_anio = $request->get('desde_anio');
        $hasta_anio = $request->get('hasta_anio');
        $alarma = $request->get('alarma') ? $request->get('alarma') : 'todos';


        $order = $request->get('order');



        $organismo = Organismo::findOne($idOrganismo)['Nombre'];
---
SELECT * FROM `organismo` WHERE `IdOrganismo`='12'