tablero/views/tablero/obras.php

                <?= Select2::widget([
                    'name' => 'idOrganismo',
                    'value' => $idOrganismo,
                    'data' => (['-1' => "Todos"] + ArrayHelper::map(Organismo::find()->orderBy(['Nombre' => SORT_ASC])->all(), 'IdOrganismo', 'Nombre')),
---
SELECT * FROM `organismo` ORDER BY `Nombre`

                <?= Select2::widget([
                    'name' => 'estado',
                    'value' => $estado,
                    'data' => ArrayHelper::map(EstadoObra::find()->orderBy(['Descripcion' => SORT_ASC])->all(), 'IdEstadoObra', 'Descripcion'),
---
SELECT * FROM `estadoobra` ORDER BY `Descripcion`